; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v6 - type_2 ?v5 - type_1)
 	      (pred_4 ?v8 - object ?v5 - type_1)
	      (pred_1 ?v6 - type_2 ?v2 - type_3)
	      (pred_2 ?v6 - type_2 ?v8 - object ?v2 - type_3))

   (:action op_2
       :parameters  (?v6 - type_2 ?v4 ?v1 - type_1)
       :precondition (and  (pred_3 ?v6 ?v4))
       :effect (and  (pred_3 ?v6 ?v1)
		     (not (pred_3 ?v6 ?v4))))

   (:action op_1
       :parameters (?v6 - type_2 ?v7 - object ?v3 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_4 ?v7 ?v3) (pred_3 ?v6 ?v3) (pred_1 ?v6 ?v2))
       :effect (and (pred_2 ?v6 ?v7 ?v2)
		    (not (pred_4 ?v7 ?v3)) 
		    (not (pred_1 ?v6 ?v2))))

   (:action op_3
       :parameters (?v6 - type_2 ?v7 - object ?v3 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v7 ?v2) (pred_3 ?v6 ?v3))
       :effect (and (pred_4 ?v7 ?v3)
		    (pred_1 ?v6 ?v2)
		    (not (pred_2 ?v6 ?v7 ?v2)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_05 obj_06 - type_2
obj_10 obj_09 obj_02 obj_04 - type_3
obj_08 obj_01 obj_11 - type_1
obj_03 obj_12 obj_07 - object)
(:init
(pred_3 obj_05 obj_08)
(pred_1 obj_05 obj_10)
(pred_1 obj_05 obj_09)
(pred_3 obj_06 obj_01)
(pred_1 obj_06 obj_02)
(pred_1 obj_06 obj_04)
(pred_4 obj_03 obj_01)
(pred_4 obj_12 obj_08)
(pred_4 obj_07 obj_08)
)
(:goal
(and
(pred_4 obj_03 obj_08)
(pred_4 obj_12 obj_11)
(pred_4 obj_07 obj_01)
)
)

(:constraints
  (always (not (pred_3 obj_05 obj_11)))
)
)

; plan
1. (op_2 obj_05 obj_08 obj_01)
   deleted: (pred_3 obj_05 obj_08)
   added: (pred_3 obj_05 obj_01)
   goals met: 0 of 3
2. (op_1 obj_06 obj_03 obj_01 obj_04)
   deleted: (pred_4 obj_03 obj_01) (pred_1 obj_06 obj_04)
   added: (pred_2 obj_06 obj_03 obj_04)
   goals met: 0 of 3
3. (op_2 obj_06 obj_01 obj_08)
   deleted: (pred_3 obj_06 obj_01)
   added: (pred_3 obj_06 obj_08)
   goals met: 0 of 3
4. (op_2 obj_05 obj_01 obj_08)
   deleted: (pred_3 obj_05 obj_01)
   added: (pred_3 obj_05 obj_08)
   goals met: 0 of 3
5. (op_3 obj_06 obj_03 obj_08 obj_04)
   deleted: (pred_2 obj_06 obj_03 obj_04)
   added: (pred_4 obj_03 obj_08) (pred_1 obj_06 obj_04)
   goals met: 1 of 3
6. (op_1 obj_06 obj_12 obj_08 obj_02)
   deleted: (pred_4 obj_12 obj_08) (pred_1 obj_06 obj_02)
   added: (pred_2 obj_06 obj_12 obj_02)
   goals met: 1 of 3
7. (op_1 obj_05 obj_07 obj_08 obj_09)
   deleted: (pred_4 obj_07 obj_08) (pred_1 obj_05 obj_09)
   added: (pred_2 obj_05 obj_07 obj_09)
   goals met: 1 of 3
8. (op_2 obj_06 obj_08 obj_11)
   deleted: (pred_3 obj_06 obj_08)
   added: (pred_3 obj_06 obj_11)
   goals met: 1 of 3
9. (op_2 obj_05 obj_08 obj_01)
   deleted: (pred_3 obj_05 obj_08)
   added: (pred_3 obj_05 obj_01)
   goals met: 1 of 3
10. (op_3 obj_06 obj_12 obj_11 obj_02)
   deleted: (pred_2 obj_06 obj_12 obj_02)
   added: (pred_4 obj_12 obj_11) (pred_1 obj_06 obj_02)
   goals met: 2 of 3
11. (op_3 obj_05 obj_07 obj_01 obj_09)
   deleted: (pred_2 obj_05 obj_07 obj_09)
   added: (pred_4 obj_07 obj_01) (pred_1 obj_05 obj_09)
   goals met: 3 of 3
